Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: One or more object animators with the <objectAnimator> element in res/animator/
zh_cn: res/animator/ 中使用 <objectAnimator> 元素声明的一个或多个对象动画

source: One way to animate Drawables is to load a series of Drawable resources one after another to create an animation.
zh_cn: 动画化 Drawables 的一种方法是逐个加载一系列 Drawable 资源来创建动画。

source: Only in very critical (and undesireable) situations will the system get to a point where all cached processes are killed and it must start killing service processes.
zh_cn: 只有在非常关键(且不希望发生)的情况下，系统才会达到这样的程度：所有缓存的进程都将被终止，它必须开始终止服务进程。

source: Only receivers who have requested that permission with the tag in their manifest (and subsequently been granted the permission if it is dangerous) can receive the broadcast.
zh_cn: 只有在其清单中使用 标记请求该权限的接收器(如果是危险权限，则需要随后被授予该权限)才能接收广播。

source: Open your layout in Android Studio and click the Design tab at the bottom of the editor window.
zh_cn: 在 Android Studio 打开你的布局，点击编辑窗口底部的 Design 标签。

source: Optimized garbage collection (GC)
zh_cn: 优化垃圾回收(GC)

source: Optimizing Layout Hierarchies
zh_cn: 优化布局层次结构

source: Optimizing the View
zh_cn: 优化视图

source: Or see the following pages to create common animations:
zh_cn: 或查看以下页面以创建常用动画：

source: Or your receiving app has a context-registered receiver as shown below:
zh_cn: 或者你的接收应用程序有一个上下文注册的接收器，如下所示：

source: Order position
zh_cn: 顺序定位

source: Other on... methods may also be overridden as required.
zh_cn: 如果需要，其他的 on... 方法也可能需要重写。

source: Other policies for killing processes may also be applied: hard limits on the number of processes allowed, limits on the amount of time a process can stay continually cached, etc.
zh_cn: 还可以应用其他用于终止进程的策略：对允许的进程数的硬限制、对进程可以持续缓存的时间的限制等等。

source: Overridden Methods
zh_cn: 重写方法

source: Override some of the methods from the superclass.
zh_cn: 重写父类的一些方法。

source: Override this method to handle the event:
zh_cn: 重写此方法以处理事件：

source: Parent position
zh_cn: 父布局位置

source: Performs an animation over a specified amount of time.
zh_cn: 在指定的时间内执行动画。

source: Perhaps a graphical VU meter that looks like an old analog gauge, or a sing-a-long text view where a bouncing ball moves along the words so you can sing along with a karaoke machine.
zh_cn: 比如看起来像一个老的模拟表的 VU 图表，或者一个有一个跟随歌词跳动的小球的 text view，就像一个卡拉 ok 机。

source: Perhaps in the case of a Combo box we might use a LinearLayout with horizontal orientation.
zh_cn: 也许在这种情况下，我们可能使用水平方向的 LinearLayout（线性布局）来完成 Combo box。

source: Permissions allow you to restrict broadcasts to the set of apps that hold certain permissions.
zh_cn: 权限允许你将广播限制为具有特定权限的应用程序集。

source: Physics-based motion
zh_cn: 基于物理的运动

source: PieChart has child views, but it never measures them.
zh_cn: PieChart 有子 view，但它从不测量它们。

source: Platform Architecture
zh_cn: 平台架构

source: Play animations in this set at the same time.
zh_cn: 同时播放此集中的动画。

source: Play animations in this set sequentially
zh_cn: 按顺序播放此集中的动画

source: Possible values are "SHOW_PROGRESS", "SHOW_PATH", or "SHOW_ALL".
zh_cn: 可能的值是 “SHOW_PROGRESS”，“SHOW_PATH”，或 “SHOW_ALL”。

source: Potential effects on UI performance
zh_cn: 对 UI 性能的潜在影响

source: Press and hold Control (Command on macOS), and then click on a constraint anchor.
zh_cn: 按住 Control(Command 在 macOS)，然后点击一个约束锚。

source: Prior to Android version 5.0 (API level 21), Dalvik was the Android runtime.
zh_cn: 在 Android 版本 5.0(API 级别 21)之前，Dalvik 是 Android 运行时。

source: Processes and Application Life Cycle
zh_cn: 进程和应用生命周期

source: Processes and Application Lifecycle
zh_cn: 进程和应用生命周期

source: Property Animation
zh_cn: 属性动画

source: Property Animation Overview
zh_cn: 属性动画概览

source: Property animation
zh_cn: 属性动画

source: Provide custom styleable attributes that work with Android XML layouts
zh_cn: 提供适用于 Android XML 布局的自定义 styleable 属性

source: Provided they implement their Activity life-cycle correctly (see Activity for more details), when the system kills such processes it will not impact the user's experience when returning to that app: it can restore the previously saved state when the associated activity is recreated in a new process.
zh_cn: 如果他们正确地实现了他们的 Activity 生命周期(请参见活动 Activity 了解更多详细信息)，那么当系统终止这些进程时，返回到该应用程序时不会影响用户的体验：当在新进程中重新创建关联的 Activity 时，它可以恢复先前保存的状态。

source: Provided they implement their Activity life-cycle correctly (see Activity for more details), the system can kill such processes at any time to reclaim memory for one of the three previous processes types.
zh_cn: 如果它们正确地实现其 Activity 生命周期(请参见活动 Activity 了解更多详细信息)，系统可以随时终止此类进程，以回收内存用于前三种进程类型之一。

source: Provides a mechanism to group animations together so that they run in relation to one another.
zh_cn: 提供一种机制，将动画分组在一起，以便它们彼此相对地运行。

source: Re-using Layouts with <include/>
zh_cn: 使用 <include/> 重用布局

source: Re-using layouts with <include/>
zh_cn: 使用 <include/> 重用布局

source: Receiving broadcasts
zh_cn: 接收广播

source: Receiving with permissions
zh_cn: 带权限接收

source: Regardless of how your animation may move or resize, the bounds of the View that holds your animation will not automatically adjust to accommodate it.
zh_cn: 无论动画如何移动或调整大小，保存动画的视图的边界都不会自动调整以适应它。

source: Remember that other layouts can be nested inside, so the compound component can be arbitrarily complex and structured.
zh_cn: 请记住其他的布局可以在内部任意嵌套，所以组件可以任意的复杂和构造。

source: Repeat count and behavior: You can specify whether or not to have an animation repeat when it reaches the end of a duration and how many times to repeat the animation.
zh_cn: 重复次数和行为：可以指定动画在到达持续时间结束时是否重复，以及重复动画的次数。

source: Repeats the animation for a specified number of cycles.
zh_cn: 在指定的周期数内重复动画。

source: Represents a RotateAnimation.
zh_cn: 表示 RotateAnimation。

source: Represents a TranslateAnimation.
zh_cn: 表示 TranslateAnimation。

source: Represents a ValueAnimator.
zh_cn: 表示 ValueAnimator。

source: Represents a ScaleAnimation.
zh_cn: 表示 ScaleAnimation。

source: Represents an AlphaAnimation.
zh_cn: 表示 AlphaAnimation。

source: Represents an ObjectAnimator.
zh_cn: 表示 ObjectAnimator。

source: Represents an AnimatorSet.
zh_cn: 表示 AnimatorSet。

source: Represents an AnimationSet.
zh_cn: 表示 AnimationSet。

source: Resource ID
zh_cn: 资源 ID

source: Resource pointer to a ValueAnimator, ObjectAnimator, or AnimatorSet.
zh_cn: 指向 ValueAnimator，ObjectAnimator 或 AnimatorSet 的资源指针。

source: Resource pointer to an Animation.
zh_cn: 指向 Animation 的资源指针。

source: Resource pointer to an AnimationDrawable.
zh_cn: 指向 AnimationDrawable 的资源指针。

source: Resource pointer to the corresponding interpolator object.
zh_cn: 指向相应插值器对象的资源指针。

source: Resource references within attribute values are not resolved
zh_cn: 未解析属性值中的资源引用

source: Restricting broadcasts with permissions
zh_cn: 使用权限限制广播

source: Retrieve attribute values at runtime
zh_cn: 在运行时获取属性值

source: Reusing layouts is particularly powerful as it allows you create reusable complex layouts.
zh_cn: 重用布局特别强大，因为它允许你创建可重用的复杂布局。

source: Revise Your Layout
zh_cn: 修改布局

source: Scheduling a job with the JobScheduler.
zh_cn: 使用 JobScheduler 调度作业。

source: Screen coordinates (not used in this example) are (0,0) at the upper left hand corner, and increase as you go down and to the right.
zh_cn: 屏幕坐标(本例中未使用)位于左上角(0,0)，并随着向下和向右移动而增加。

source: Security considerations and best practices
zh_cn: 安全考虑和最佳做法

source: See Using interpolators for more information on how to write a custom interpolator.
zh_cn: 有关如何编写自定义插值程序的详细信息，请参见 Using interpolators。

source: See the Activity, Service, and BroadcastReceiver documentation for more detail on how each of these components contribute to the overall life-cycle of a process.
zh_cn: 查看 Activity，Service 和 BroadcastReceiver 文档，了解每个组件有助于进程的整体生命周期的更多细节。

source: See the GLSurfaceViewActivity sample for details.
zh_cn: 更多细节可以查看 GLSurfaceViewActivity sample。

source: See the discussion below for more about Interpolators.
zh_cn: 有关 Interpolators 的详细信息，请参见下面的讨论。

source: See the section about Choreographing multiple animations with Animator Sets for more information.
zh_cn: 有关详细信息，请参见关于 Choreographing multiple animations with Animator Sets

source: See the section about Animating with ValueAnimator for more information.
zh_cn: 有关详细信息，请参见 Animating with ValueAnimator 部分。

source: See the section about Using a TypeEvaluator for more information on how to write a custom evaluator.
zh_cn: 有关如何编写自定义计算器的详细信息，请参见关于 Using a TypeEvaluator 部分。

source: Select the barrier from the Component Tree, open the Attributes window, and then set the barrierDirection.
zh_cn: 从 Component Tree 中选择屏障，打开 Attributes 窗口，然后设置 barrierDirection。

source: Send accessibility events
zh_cn: 发送无障碍事件

source: Send accessibility events by calling sendAccessibilityEvent() when appropriate.
zh_cn: 适当时通过调用 sendAccessibilityEvent() 发送无障碍事件。

source: Sending broadcasts
zh_cn: 发送广播

source: Sending with permissions
zh_cn: 使用权限发送

source: Services that have been running for a long time (such as 30 minutes or more) may be demoted in importance to allow their process to drop to the cached LRU list described next.
zh_cn: 运行了很长时间(如 30 分钟或更长)的服务可能会被降级，以允许其进程降到下面描述的缓存的 LRU 列表中。

source: Set size as a ratio
zh_cn: 将大小设置为比例

source: Set to "-1" to infinitely repeat or to a positive integer.
zh_cn: 设为 "-1" 可无限重复或设为正整数。

source: Set to "reverse" to have the animation reverse direction with each iteration or "repeat" to have the animation loop from the beginning each time.
zh_cn: 设置为 "reverse" 可使动画在每次迭代时反转方向，或设置为 "repeat" 可使动画循环每次从头开始。

source: Set up a ValueAnimator to animate for the duration of the fling, and add a listener to process animation updates by calling addUpdateListener().
zh_cn: 设置 ValueAnimator 以在 fling 持续时间内设置动画，并通过调用 addUpdateListener()。

source: Setting it to reverse plays the animation forwards then backwards repeatedly, until the number of repeats is reached.
zh_cn: 将其设置为“反向”(reverse)将反复向前和向后播放动画，直到达到重复次数为止。

source: Similar to a guideline, a barrier is an invisible line that you can constrain views to.
zh_cn: 与参考线类似，屏障是一种无形的线，你可以约束 view。

source: Simply put, Canvas defines shapes that you can draw on the screen, while Paint defines the color, style, font, and so forth of each shape you draw.
zh_cn: 简单地说，Canvas 定义可以在屏幕上绘制的形状，而 Paint 定义你绘制的每个形状的颜色，样式，字体等。

source: So a third-party app can become the user's default web browser, SMS messenger, or even the default keyboard (some exceptions apply, such as the system's Settings app).
zh_cn: 因此，第三方应用程序可以成为用户的默认 web 浏览器、SMS messenger，甚至默认键盘(有一些例外情况，例如系统的设置应用程序)。

source: So a vertical plane (the left and right sides) of a view can be constrained only to another vertical plane; and baselines can constrain only to other baselines.
zh_cn: 因此，view 的垂直平面(左侧和右侧)可以仅被约束到另一个垂直平面；并且基线只可以约束其他基线。

source: So be sure you include other constraints to achieve the proper position for each view in the chain, such as alignment constraints.
zh_cn: 因此，请确保包括其他约束，以实现链中每个 view 的正确位置，例如 alignment constraints。

source: So the difference between this and using Wrap Content (above), is that setting the width to Wrap Content forces the width to always exactly match the content width; whereas using Match Constraints with layout_constraintWidth_default set to wrap also allows the view to be smaller than the content width.
zh_cn: 因此，这与使用 Wrap Content 之间的区别在于，将宽度设置为 Wrap Content 会强制宽度始终与内容宽度完全匹配；而使用 Match Constraints 和 layout_constraintWidth_default 设置为 wrap 也会允许视图小于内容宽度。

source: So the view with the highest weight value gets the most amount of space; views that have the same weight get the same amount of space.
zh_cn: 因此，具有最高权重值的 view 获得最大的空间量;具有相同重量的 view 获得相同的空间量。

source: So while you can create individual UI components by writing a custom View, you can do it even more easily by re-using a layout file.
zh_cn: 因此，虽然可以通过编写自定义 View 来创建单个 UI 组件，但可以通过重新使用布局文件来更轻松地创建。

source: So you can build your layout with ConstraintLayout entirely by drag-and-dropping instead of editing the XML.
zh_cn: 因此你可以完全通过拖拽的方式去构建一个使用 ConstraintLayout，而不用直接在 XML 中编辑。

source: So, before you draw anything, you need to create one or more Paint objects.
zh_cn: 因此，在绘制任何内容之前，需要创建一个或多个 Paint 对象。

source: So, if you have a TextView object, you can move, rotate, grow, or shrink the text.
zh_cn: 因此，如果有一个 TextView 对象，则可以移动、旋转、增大或缩小文本。

source: So, the system may kill the process at any time to reclaim memory, and in doing so, it terminates the spawned thread running in the process.
zh_cn: 因此，系统可以随时终止进程以回收内存，这样做时，它会终止进程中运行的派生线程。

source: So, when this design is converted to use RelativeLayout, you can see that the layout becomes a 2-level hierarchy.
zh_cn: 因此，当此设计转换为使用 RelativeLayout 时，可以看到布局变成了一个两级层次结构。

source: Some examples of lint rules are:
zh_cn: lint rules 的一些示例如下：

source: Some of the major features of ART include the following:
zh_cn: ART 的一些主要特征包括：

source: Some values, such as pivotX, can be specified relative to the object itself or relative to the parent.
zh_cn: 某些值(如 pivotX)可以相对于对象本身或相对于父对象指定。

source: Sometimes your layout might require complex views that are rarely used.
zh_cn: 有时，你的布局可能需要很少使用的复杂视图。

source: Sometimes, the Android system itself enforces the use of context-registered receivers.
zh_cn: 有时，Android 系统本身会强制使用上下文注册接收器。

source: Specifies that the animated values are floats
zh_cn: 指定动画值是浮点数

source: Specifies that the animated values are integers
zh_cn: 指定动画值是整数

source: Specifies the play ordering of animations in this set.
zh_cn: 指定此集中动画的播放顺序。

source: Specify the <receiver> element in your app's manifest.
zh_cn: 指定应用程序清单中的 <receiver> 元素。

source: Specify the typeface by calling setTypeface(), and the text color by calling setColor().
zh_cn: 通过调用 setTypeface() 指定字体，通过调用 setColor() 指定文本颜色。

source: Specify values for the attributes in your XML layout
zh_cn: 在 XML 布局中指定属性的值

source: Spring Animation
zh_cn: 弹簧动画

source: Start by working on onDraw(), which will give you the biggest payback.
zh_cn: 首先处理 onDraw()，这将为你带来最大的回报。

source: Starting X offset.
zh_cn: 起始 X 偏移。

source: Starting X size offset, where 1.0 is no change.
zh_cn: 起始 X 尺寸偏移，其中 1.0 不变。

source: Starting Y offset.
zh_cn: 起始 Y 偏移。

source: Starting Y size offset, where 1.0 is no change.
zh_cn: 起始 Y 尺寸偏移，其中 1.0 不变。

source: Starting angular position, in degrees.
zh_cn: 起始角度位置，单位为度。

source: Starting opacity offset, where 0.0 is transparent and 1.0 is opaque.
zh_cn: 开始不透明度偏移，其中 0.0 是透明的，1.0 是不透明的。

source: Styles are not applied
zh_cn: 样式未运用

source: Subclass BroadcastReceiver and implement onReceive(Context, Intent).
zh_cn: 子类化 BroadcastReceiver 并实现 onReceive(Context, Intent)。

source: Subclass a View
zh_cn: 实现 View 的子类

source: Such a process is considered extremely important and will not be killed unless doing so is required to keep all foreground processes running.
zh_cn: 这样的进程被认为是非常重要的，并且不会被终止，除非这样做是为了保持所有前台进程都在运行。

source: Support alternate controllers, such as D-pad and trackball
zh_cn: 支持备用控制器，如 D-pad 和轨迹球

source: Supports the following attributes in any of the following three formats: values from -100 to 100 ending with "%", indicating a percentage relative to itself; values from -100 to 100 ending in "%p", indicating a percentage relative to its parent; a float value with no suffix, indicating an absolute value.
zh_cn: 支持以下三种格式中的任何一种：以“%”结尾的-100 到 100 之间的值，表示相对于自身的百分比；以“%p”结尾的-100 到 100 之间的值，表示相对于其父级的百分比；不带后缀的浮点值，表示绝对值。

source: Swap views with a card flip
zh_cn: 用卡牌翻转交换视图

source: System Apps
zh_cn: 系统应用

source: System broadcasts are sent to all apps that are subscribed to receive the event.
zh_cn: 系统广播发送给订阅接收事件的所有应用程序。

source: Table 3 describes the interpolators that are contained in android.view.animation.
zh_cn: 表 3 描述了 android.view.animation 中包含的插值器。

source: Taking some time to carefully define your view's interface reduces future maintenance costs.
zh_cn: 花些时间仔细定义 view 接口可以降低未来的维护成本。

source: The hardware abstraction layer (HAL) provides standard interfaces that expose device hardware capabilities to the higher-level Java API framework.
zh_cn: 硬件抽象层 (HAL) 提供标准接口，将设备硬件功能公开给更高级别的 Java API 框架。

source: The tools:showIn attribute in the XML above is a special attribute that is removed during compilation and used only at design time in Android Studio—it specifies a layout that includes this file, so you can preview (and edit) this file as it appears while embedded in a parent layout.
zh_cn: 上面 XML 中的 tools:showIn 属性是一个特殊属性，在编译过程中被删除，并且只在 Android Studio 的设计时使用 — 它指定了一个 includes 此文件的布局，因此你可以在嵌入父布局时预览(和编辑)此文件。

source: The Layout section of the Attributes window lets you create connections.
zh_cn: Attributes 窗口的 Layout 部分允许你创建连接。

source: The Animator class provides the basic structure for creating animations.
zh_cn: Animator 类提供了创建动画的基本结构。

source: The LocalBroadcastManager.sendBroadcast method sends broadcasts to receivers that are in the same app as the sender.
zh_cn: LocalBroadcastManager.sendBroadcast 方法将广播发送到与发送方位于同一应用程序中的接收器。

source: The Scroller class computes scroll positions for you, but it does not automatically apply those positions to your view.
zh_cn: Scroller 类为你计算滚动位置，但它不会自动将这些位置应用于你的view。

source: The Scroller class is the basis for handling flywheel-style fling gestures.
zh_cn: Scroller 类是处理飞轮式 fling 手势的基础。

source: The ValueAnimator encapsulates a TimeInterpolator, which defines animation interpolation, and a TypeEvaluator, which defines how to calculate values for the property being animated.
zh_cn: ValueAnimator 封装了定义动画插值的 TimeInterpolator，以及定义如何计算要设置动画的属性值的 TypeEvaluator。

source: The ValueAnimator object keeps track of your animation's timing, such as how long the animation has been running, and the current value of the property that it is animating.
zh_cn: ValueAnimator 对象会跟踪动画的计时，例如动画运行的时间，以及它正在设置动画的属性的当前值。

source: The android.graphics framework divides drawing into two areas:
zh_cn: android.graphics 框架将绘制划分为两个区域：

source: The sendBroadcast(Intent) method sends broadcasts to all receivers in an undefined order.
zh_cn: sendBroadcast(Intent) 方法以未定义的顺序向所有接收器发送广播。

source: The sendOrderedBroadcast(Intent, String) method sends broadcasts to one receiver at a time.
zh_cn: sendOrderedBroadcast(Intent, String) 方法一次向一个接收器发送广播。

source: The <merge /> tag helps eliminate redundant view groups in your view hierarchy when including one layout within another.
zh_cn: <merge /> 标签有助于在将一个布局包含在另一个布局中时消除视图层次结构中的冗余视图组。

source: The onDraw() and onMeasure() methods (plus most of the other on... methods) will likely have suitable behavior so you don't have to override them.
zh_cn: onDraw() 和 onMeasure() 方法（加上其他的 on... 方法) 已经有合适的行为了，不需要重写它们。

source: The onDraw() method delivers you a Canvas upon which you can implement anything you want: 2D graphics, other standard or custom components, styled text, or anything else you can think of.
zh_cn: onDraw() 方法给你提供一个 Canvas，在其中你可以实现任何你想要的东西。2D 图形，其他标准或自定义的组件，带风格的文字，以及任何你想要的别的东西。

source: The AnimatedVectorDrawable class (and AnimatedVectorDrawableCompat for backward-compatibility) lets you animate the properties of a vector drawable, such as rotating it or changing the path data to morph it into a different image.
zh_cn: AnimatedVectorDrawable 类(和 AnimatedVectorDrawableCompat 用于向后兼容)允许设置 vector drawable 的属性的动画，例如旋转或更改路径数据以将其变形为不同的图像。

source: The inflate() method returns the inflated View once complete.
zh_cn: inflate() 方法返回加载完成的 View。

source: The AnimationDrawable class is the basis for Drawable animations.
zh_cn: AnimationDrawable 类是 Drawable 动画的基础。

source: The animation package provides all the classes used in a tween animation.
zh_cn: 在 animation package 提供了所有在补间动画使用的类。

source: The <group> elements defines a set of paths or subgroups, and the <path> element defines paths to be drawn.
zh_cn: <group> 元素定义一组路径或子组，而 <path> 元素定义要绘制的路径。

source: The PieChart example does this in a method called init, which is called from the constructor from Java, but we can initialise inline in Kotlin:
zh_cn: PieChart 示例在名为 init 的方法中执行此操作，该方法是从 Java 的构造函数中调用的，但我们可以在 Kotlin 中初始化内联：

source: The LocalBroadcastManager is much more efficient (no interprocess communication needed) and allows you to avoid thinking about any security issues related to other apps being able to receive or send your broadcasts.
zh_cn: LocalBroadcastManager 效率更高(不需要进程间通信)，并且允许你避免考虑与能够接收或发送你的广播的其他应用程序相关的任何安全问题。

source: The objectAnimator element does not expose a target attribute, however, so you cannot set the object to animate in the XML declaration.
zh_cn: 但是，objectAnimator 元素不公开 target 属性，因此不能在 XML 声明中将对象设置为 animate。

source: The Canvas class defines methods for drawing text, lines, bitmaps, and many other graphics primitives.
zh_cn: Canvas 类定义了绘制文本，线条，位图和许多其他图形基元的方法。

source: The Android property animation framework, introduced in Android 3.0, makes smooth transitions easy.
zh_cn: Android 3.0 中引入的 property animation framework 使平滑过渡变得容易。

source: The Android SDK includes tools to help you identify problems in your layout performance, which when combined the lessons here, you will be able to implement smooth scrolling interfaces with a minimum memory footprint.
zh_cn: Android SDK 包括一些工具，可以帮助你识别布局性能中的问题，结合这里的课程，你将能够以最小的内存占用实现平滑的滚动界面。

source: The Android SDK tools include a tool called Hierarchy Viewer that allows you to analyze your layout while your application is running.
zh_cn: Android SDK 工具包括一个名为 Hierarchy Viewer 的工具，它允许你在应用程序运行时分析布局。

source: The Android framework provides a set of base classes and XML tags to help you create a view that meets all of these requirements.
zh_cn: Android 框架提供了一组基类和 XML 标记，可帮助你创建满足所有这些要求的视图。

source: The Android platform provides Java framework APIs to expose the functionality of some of these native libraries to apps.
zh_cn: Android 平台提供了 Java 框架 API 来向应用程序公开其中一些原生库的功能。

source: The Android resource compiler does a lot of work for you to make calling obtainStyledAttributes() easier.
zh_cn: Android 资源编译器为你做了很多工作，使你更容易调用 obtainStyledAttributes()。

source: The Basic Approach
zh_cn: 基本的方法

source: The Definition
zh_cn: 定义

source: The EditText is created with these parameters when it is inflated from an XML layout file, thus, our constructor needs to both take them and pass them to the superclass constructor as well.
zh_cn: 当 EditText 从 XML 布局文件加载时，它用这些参数来创建。因此，我们的构造方法需要获取参数并传递给父类。

source: The HAL consists of multiple library modules, each of which implements an interface for a specific type of hardware component, such as the camera or bluetooth module.
zh_cn: HAL 由多个库模块组成，每个库模块实现一个特定类型硬件组件的接口，例如 camera 或 bluetooth 模块。

source: The Inspection Configuration page appears with the supported inspections.
zh_cn: 将显示检查配置页，其中包含支持的检查。

source: The Linux Kernel
zh_cn: Linux 内核

source: The PieChart example is a little different: it uses the current scroll y position to set the rotational angle of the chart.
zh_cn: 饼图示例略有不同：它使用当前滚动 y 位置来设置图表的旋转角度。

source: The PieChart example shows how to extend ViewGroup as part of a custom view.
zh_cn: PieChart 示例显示如何将 ViewGroup 继承为自定义 view 的一部分。

source: The PieChart example uses the second approach.
zh_cn: PieChart 示例使用第二种方法。

source: The X coordinate of the center of rotation.
zh_cn: 旋转中心的 X 坐标。

source: The X coordinate to remain fixed when the object is scaled.
zh_cn: 缩放对象时保持固定的 X 坐标。

source: The XML file consists of an <animation-list> element as the root node and a series of child <item> nodes that each define a frame: a drawable resource for the frame and the frame duration.
zh_cn: XML 文件由作为根节点的 <animation-list> 元素和一系列 <item> 子节点组成，每个子节点定义一个帧：帧的 drawable 资源和帧持续时间。

source: The XML file for this kind of animation belongs in the res/drawable/ directory of your Android project.
zh_cn: 这种动画的 XML 文件属于 Android 项目的 res/drawable/ 目录。

source: The Y coordinate of the center of rotation.
zh_cn: 旋转中心的 Y 坐标。

source: The Y coordinate to remain fixed when the object is scaled.
zh_cn: 缩放对象时保持固定的 Y 坐标。

source: The acceleration rate (default is 1).
zh_cn: 加速率(默认为 1)。

source: The amount by which to multiply the tension (default is 1.5).
zh_cn: 乘以张力的量(默认值为 1.5)。

source: The amount of milliseconds the animation delays after start() is called.
zh_cn: 调用 start() 之后动画延迟的毫秒数。
